# Вычислить число c заданной точностью d
# Пример:

# при $d = 0.001, π = 3.141

x = 3.141592653589793
y = int(input("Введите количество знаков после запятой: "))
print((round((x),y)))